# IsBound Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveUV..::..IsBound Property
CurveUV Class See Also
---
Describes whether the parameter of the curve is restricted to a particular interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsBound { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsBound As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsBound {
	bool get ();
}
```

# See Also
CurveUV Class
Autodesk.Revit.DB Namespace